         01 CIAUL-REC.
            05 CIAUL-KEY.
              10 CIAUL-CARD-NUMB            PIC 9(16).
              10 CIAUL-TIMESTAMP            PIC 9(14).
              10 CIAUL-AUTH-CODE            PIC 9(06).
            05 CIAUL-RESP-CODE            PIC 9(03).
            05 CIAUL-TRAN-TYPE            PIC 9(02).
            05 CIAUL-TRAN-AMOUNT          PIC 9(08).
            05 CIAUL-AUTH-ID              PIC X(08).
