         01 CIC0024I-REC.
            05 CIC0024I-CARD-NUMB         PIC 9(16).
            05 CIC0024I-TIMESTAMP         PIC 9(14).
            05 CIC0024I-AUTH-CODE         PIC 9(06).
