       01 CIC0000I-REC.
          05 CIC0000I-PROD-NUMB.
             15 CIC0000I-PROD-TYPE            PIC 9(3).
             15 CIC0000I-CARD-NUMB            PIC 9(16).
          05 CIC0000I-DIRECTION            PIC X(2).
