         01 CIC0023O-REC.
            05 CIC0023O-KEY.
              10 CIC0023O-NUMB              PIC 9(16).
              10 CIC0023O-DATE              PIC X(08).
              10 CIC0023O-TIME              PIC X(06).
              10 CIC0023O-AUTH-CODE         PIC 9(06).
            05 CIC0023O-RESP-CODE           PIC 9(03).
            05 CIC0023O-TRAN-TYPE           PIC 9(02).
            05 CIC0023O-TRAN-AMOUNT         PIC 9(08).
