         01 CIC0023I-REC.
            05 CIC0023I-KEY.
              10 CIC0023I-NUMB              PIC 9(16).
              10 CIC0023I-DATE              PIC X(08).
              10 CIC0023I-TIME              PIC X(06).
              10 CIC0023I-AUTH-CODE         PIC 9(06).
            05 CIC0023I-RESP-CODE           PIC 9(03).
            05 CIC0023I-TRAN-TYPE           PIC 9(02).
            05 CIC0023I-TRAN-AMOUNT         PIC 9(08).
            05 CIC0023I-AUTH-ID             PIC X(08).
