         01 CIC0026I-REC.
            05 CIC0026I-OPTION               PIC 9(03).
            05 CIC0026I-CARD-NUMB            PIC 9(16).
            05 CIC0026I-START-TIME           PIC 9(14).
            05 CIC0026I-END-TIME             PIC 9(14).
            05 CIC0026I-DIRECTION            PIC X(02).
