       01  CICA02I.
           02  FILLER PIC X(12).
           02  SYSDL    COMP  PIC  S9(4).
           02  SYSDF    PICTURE X.
           02  FILLER REDEFINES SYSDF.
             03 SYSDA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  SYSDI  PIC X(10).
           02  COMMUL    COMP  PIC  S9(4).
           02  COMMUF    PICTURE X.
           02  FILLER REDEFINES COMMUF.
             03 COMMUA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  COMMUI  PIC X(4).
           02  SYSTL    COMP  PIC  S9(4).
           02  SYSTF    PICTURE X.
           02  FILLER REDEFINES SYSTF.
             03 SYSTA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  SYSTI  PIC X(10).
           02  NAMEL    COMP  PIC  S9(4).
           02  NAMEF    PICTURE X.
           02  FILLER REDEFINES NAMEF.
             03 NAMEA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  NAMEI  PIC X(30).
           02  BIRTHL    COMP  PIC  S9(4).
           02  BIRTHF    PICTURE X.
           02  FILLER REDEFINES BIRTHF.
             03 BIRTHA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  BIRTHI  PIC X(10).
           02  GENDERL    COMP  PIC  S9(4).
           02  GENDERF    PICTURE X.
           02  FILLER REDEFINES GENDERF.
             03 GENDERA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  GENDERI  PIC X(1).
           02  ENAMEL    COMP  PIC  S9(4).
           02  ENAMEF    PICTURE X.
           02  FILLER REDEFINES ENAMEF.
             03 ENAMEA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  ENAMEI  PIC X(40).
           02  MOBILEL    COMP  PIC  S9(4).
           02  MOBILEF    PICTURE X.
           02  FILLER REDEFINES MOBILEF.
             03 MOBILEA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  MOBILEI  PIC X(11).
           02  NATIONL    COMP  PIC  S9(4).
           02  NATIONF    PICTURE X.
           02  FILLER REDEFINES NATIONF.
             03 NATIONA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  NATIONI  PIC X(20).
           02  MASTUSL    COMP  PIC  S9(4).
           02  MASTUSF    PICTURE X.
           02  FILLER REDEFINES MASTUSF.
             03 MASTUSA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  MASTUSI  PIC X(1).
           02  IDTYPEL    COMP  PIC  S9(4).
           02  IDTYPEF    PICTURE X.
           02  FILLER REDEFINES IDTYPEF.
             03 IDTYPEA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  IDTYPEI  PIC X(3).
           02  IDNUML    COMP  PIC  S9(4).
           02  IDNUMF    PICTURE X.
           02  FILLER REDEFINES IDNUMF.
             03 IDNUMA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  IDNUMI  PIC X(18).
           02  EMAILL    COMP  PIC  S9(4).
           02  EMAILF    PICTURE X.
           02  FILLER REDEFINES EMAILF.
             03 EMAILA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  EMAILI  PIC X(40).
           02  ANSRYL    COMP  PIC  S9(4).
           02  ANSRYF    PICTURE X.
           02  FILLER REDEFINES ANSRYF.
             03 ANSRYA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  ANSRYI  PIC X(8).
           02  BITYPEL    COMP  PIC  S9(4).
           02  BITYPEF    PICTURE X.
           02  FILLER REDEFINES BITYPEF.
             03 BITYPEA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  BITYPEI  PIC X(3).
           02  BIDATEL    COMP  PIC  S9(4).
           02  BIDATEF    PICTURE X.
           02  FILLER REDEFINES BIDATEF.
             03 BIDATEA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  BIDATEI  PIC X(2).
           02  BIADDRL    COMP  PIC  S9(4).
           02  BIADDRF    PICTURE X.
           02  FILLER REDEFINES BIADDRF.
             03 BIADDRA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  BIADDRI  PIC X(3).
           02  APDATEL    COMP  PIC  S9(4).
           02  APDATEF    PICTURE X.
           02  FILLER REDEFINES APDATEF.
             03 APDATEA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  APDATEI  PIC X(10).
           02  LCTRYL    COMP  PIC  S9(4).
           02  LCTRYF    PICTURE X.
           02  FILLER REDEFINES LCTRYF.
             03 LCTRYA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  LCTRYI  PIC X(20).
           02  LPROVL    COMP  PIC  S9(4).
           02  LPROVF    PICTURE X.
           02  FILLER REDEFINES LPROVF.
             03 LPROVA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  LPROVI  PIC X(20).
           02  LCITYL    COMP  PIC  S9(4).
           02  LCITYF    PICTURE X.
           02  FILLER REDEFINES LCITYF.
             03 LCITYA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  LCITYI  PIC X(20).
           02  LDISTL    COMP  PIC  S9(4).
           02  LDISTF    PICTURE X.
           02  FILLER REDEFINES LDISTF.
             03 LDISTA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  LDISTI  PIC X(20).
           02  LZIPCL    COMP  PIC  S9(4).
           02  LZIPCF    PICTURE X.
           02  FILLER REDEFINES LZIPCF.
             03 LZIPCA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  LZIPCI  PIC X(6).
           02  LYEARSL    COMP  PIC  S9(4).
           02  LYEARSF    PICTURE X.
           02  FILLER REDEFINES LYEARSF.
             03 LYEARSA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  LYEARSI  PIC X(3).
           02  LADDRL    COMP  PIC  S9(4).
           02  LADDRF    PICTURE X.
           02  FILLER REDEFINES LADDRF.
             03 LADDRA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  LADDRI  PIC X(40).
           02  CNAMEL    COMP  PIC  S9(4).
           02  CNAMEF    PICTURE X.
           02  FILLER REDEFINES CNAMEF.
             03 CNAMEA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  CNAMEI  PIC X(40).
           02  CZIPCL    COMP  PIC  S9(4).
           02  CZIPCF    PICTURE X.
           02  FILLER REDEFINES CZIPCF.
             03 CZIPCA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  CZIPCI  PIC X(6).
           02  CCTRYL    COMP  PIC  S9(4).
           02  CCTRYF    PICTURE X.
           02  FILLER REDEFINES CCTRYF.
             03 CCTRYA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  CCTRYI  PIC X(20).
           02  CPROVL    COMP  PIC  S9(4).
           02  CPROVF    PICTURE X.
           02  FILLER REDEFINES CPROVF.
             03 CPROVA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  CPROVI  PIC X(20).
           02  CCITYL    COMP  PIC  S9(4).
           02  CCITYF    PICTURE X.
           02  FILLER REDEFINES CCITYF.
             03 CCITYA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  CCITYI  PIC X(20).
           02  CDISTL    COMP  PIC  S9(4).
           02  CDISTF    PICTURE X.
           02  FILLER REDEFINES CDISTF.
             03 CDISTA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  CDISTI  PIC X(20).
           02  CADDRL    COMP  PIC  S9(4).
           02  CADDRF    PICTURE X.
           02  FILLER REDEFINES CADDRF.
             03 CADDRA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  CADDRI  PIC X(40).
           02  CSRVYL    COMP  PIC  S9(4).
           02  CSRVYF    PICTURE X.
           02  FILLER REDEFINES CSRVYF.
             03 CSRVYA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  CSRVYI  PIC X(3).
           02  MSGL    COMP  PIC  S9(4).
           02  MSGF    PICTURE X.
           02  FILLER REDEFINES MSGF.
             03 MSGA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  MSGI  PIC X(79).
           02  KEYL    COMP  PIC  S9(4).
           02  KEYF    PICTURE X.
           02  FILLER REDEFINES KEYF.
             03 KEYA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  KEYI  PIC X(79).
       01  CICA02O REDEFINES CICA02I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  SYSDC    PICTURE X.
           02  SYSDH    PICTURE X.
           02  SYSDO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  COMMUC    PICTURE X.
           02  COMMUH    PICTURE X.
           02  COMMUO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SYSTC    PICTURE X.
           02  SYSTH    PICTURE X.
           02  SYSTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  NAMEC    PICTURE X.
           02  NAMEH    PICTURE X.
           02  NAMEO  PIC X(30).
           02  FILLER PICTURE X(3).
           02  BIRTHC    PICTURE X.
           02  BIRTHH    PICTURE X.
           02  BIRTHO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  GENDERC    PICTURE X.
           02  GENDERH    PICTURE X.
           02  GENDERO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  ENAMEC    PICTURE X.
           02  ENAMEH    PICTURE X.
           02  ENAMEO  PIC X(40).
           02  FILLER PICTURE X(3).
           02  MOBILEC    PICTURE X.
           02  MOBILEH    PICTURE X.
           02  MOBILEO  PIC X(11).
           02  FILLER PICTURE X(3).
           02  NATIONC    PICTURE X.
           02  NATIONH    PICTURE X.
           02  NATIONO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  MASTUSC    PICTURE X.
           02  MASTUSH    PICTURE X.
           02  MASTUSO  PIC X(1).
           02  FILLER PICTURE X(3).
           02  IDTYPEC    PICTURE X.
           02  IDTYPEH    PICTURE X.
           02  IDTYPEO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  IDNUMC    PICTURE X.
           02  IDNUMH    PICTURE X.
           02  IDNUMO  PIC X(18).
           02  FILLER PICTURE X(3).
           02  EMAILC    PICTURE X.
           02  EMAILH    PICTURE X.
           02  EMAILO  PIC X(40).
           02  FILLER PICTURE X(3).
           02  ANSRYC    PICTURE X.
           02  ANSRYH    PICTURE X.
           02  ANSRYO  PIC X(8).
           02  FILLER PICTURE X(3).
           02  BITYPEC    PICTURE X.
           02  BITYPEH    PICTURE X.
           02  BITYPEO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  BIDATEC    PICTURE X.
           02  BIDATEH    PICTURE X.
           02  BIDATEO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  BIADDRC    PICTURE X.
           02  BIADDRH    PICTURE X.
           02  BIADDRO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  APDATEC    PICTURE X.
           02  APDATEH    PICTURE X.
           02  APDATEO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  LCTRYC    PICTURE X.
           02  LCTRYH    PICTURE X.
           02  LCTRYO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  LPROVC    PICTURE X.
           02  LPROVH    PICTURE X.
           02  LPROVO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  LCITYC    PICTURE X.
           02  LCITYH    PICTURE X.
           02  LCITYO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  LDISTC    PICTURE X.
           02  LDISTH    PICTURE X.
           02  LDISTO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  LZIPCC    PICTURE X.
           02  LZIPCH    PICTURE X.
           02  LZIPCO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  LYEARSC    PICTURE X.
           02  LYEARSH    PICTURE X.
           02  LYEARSO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  LADDRC    PICTURE X.
           02  LADDRH    PICTURE X.
           02  LADDRO  PIC X(40).
           02  FILLER PICTURE X(3).
           02  CNAMEC    PICTURE X.
           02  CNAMEH    PICTURE X.
           02  CNAMEO  PIC X(40).
           02  FILLER PICTURE X(3).
           02  CZIPCC    PICTURE X.
           02  CZIPCH    PICTURE X.
           02  CZIPCO  PIC X(6).
           02  FILLER PICTURE X(3).
           02  CCTRYC    PICTURE X.
           02  CCTRYH    PICTURE X.
           02  CCTRYO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  CPROVC    PICTURE X.
           02  CPROVH    PICTURE X.
           02  CPROVO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  CCITYC    PICTURE X.
           02  CCITYH    PICTURE X.
           02  CCITYO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  CDISTC    PICTURE X.
           02  CDISTH    PICTURE X.
           02  CDISTO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  CADDRC    PICTURE X.
           02  CADDRH    PICTURE X.
           02  CADDRO  PIC X(40).
           02  FILLER PICTURE X(3).
           02  CSRVYC    PICTURE X.
           02  CSRVYH    PICTURE X.
           02  CSRVYO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  MSGC    PICTURE X.
           02  MSGH    PICTURE X.
           02  MSGO  PIC X(79).
           02  FILLER PICTURE X(3).
           02  KEYC    PICTURE X.
           02  KEYH    PICTURE X.
           02  KEYO  PIC X(79).
