       01  CICP04I.
           02  FILLER PIC X(12).
           02  SYSDL    COMP  PIC  S9(4).
           02  SYSDF    PICTURE X.
           02  FILLER REDEFINES SYSDF.
             03 SYSDA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  SYSDI  PIC X(10).
           02  COMMUL    COMP  PIC  S9(4).
           02  COMMUF    PICTURE X.
           02  FILLER REDEFINES COMMUF.
             03 COMMUA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  COMMUI  PIC X(4).
           02  SYSTL    COMP  PIC  S9(4).
           02  SYSTF    PICTURE X.
           02  FILLER REDEFINES SYSTF.
             03 SYSTA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  SYSTI  PIC X(10).
           02  PTYPEL    COMP  PIC  S9(4).
           02  PTYPEF    PICTURE X.
           02  FILLER REDEFINES PTYPEF.
             03 PTYPEA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  PTYPEI  PIC X(3).
           02  CANUML    COMP  PIC  S9(4).
           02  CANUMF    PICTURE X.
           02  FILLER REDEFINES CANUMF.
             03 CANUMA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  CANUMI  PIC X(16).
           02  CUNUML    COMP  PIC  S9(4).
           02  CUNUMF    PICTURE X.
           02  FILLER REDEFINES CUNUMF.
             03 CUNUMA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  CUNUMI  PIC X(18).
           02  CASTAL    COMP  PIC  S9(4).
           02  CASTAF    PICTURE X.
           02  FILLER REDEFINES CASTAF.
             03 CASTAA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  CASTAI  PIC X(3).
           02  ACNUML    COMP  PIC  S9(4).
           02  ACNUMF    PICTURE X.
           02  FILLER REDEFINES ACNUMF.
             03 ACNUMA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  ACNUMI  PIC X(16).
           02  LUDATL    COMP  PIC  S9(4).
           02  LUDATF    PICTURE X.
           02  FILLER REDEFINES LUDATF.
             03 LUDATA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  LUDATI  PIC X(10).
           02  OPDATL    COMP  PIC  S9(4).
           02  OPDATF    PICTURE X.
           02  FILLER REDEFINES OPDATF.
             03 OPDATA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  OPDATI  PIC X(10).
           02  DIINDL    COMP  PIC  S9(4).
           02  DIINDF    PICTURE X.
           02  FILLER REDEFINES DIINDF.
             03 DIINDA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  DIINDI  PIC X(2).
           02  DISUBL    COMP  PIC  S9(4).
           02  DISUBF    PICTURE X.
           02  FILLER REDEFINES DISUBF.
             03 DISUBA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  DISUBI  PIC X(10).
           02  DIDATL    COMP  PIC  S9(4).
           02  DIDATF    PICTURE X.
           02  FILLER REDEFINES DIDATF.
             03 DIDATA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  DIDATI  PIC X(10).
           02  CATYPL    COMP  PIC  S9(4).
           02  CATYPF    PICTURE X.
           02  FILLER REDEFINES CATYPF.
             03 CATYPA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  CATYPI  PIC X(2).
           02  PSINDL    COMP  PIC  S9(4).
           02  PSINDF    PICTURE X.
           02  FILLER REDEFINES PSINDF.
             03 PSINDA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  PSINDI  PIC X(2).
           02  LOINDL    COMP  PIC  S9(4).
           02  LOINDF    PICTURE X.
           02  FILLER REDEFINES LOINDF.
             03 LOINDA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  LOINDI  PIC X(2).
           02  LODATL    COMP  PIC  S9(4).
           02  LODATF    PICTURE X.
           02  FILLER REDEFINES LODATF.
             03 LODATA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  LODATI  PIC X(10).
           02  EXDATL    COMP  PIC  S9(4).
           02  EXDATF    PICTURE X.
           02  FILLER REDEFINES EXDATF.
             03 EXDATA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  EXDATI  PIC X(10).
           02  ACINDL    COMP  PIC  S9(4).
           02  ACINDF    PICTURE X.
           02  FILLER REDEFINES ACINDF.
             03 ACINDA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  ACINDI  PIC X(2).
           02  AVDATL    COMP  PIC  S9(4).
           02  AVDATF    PICTURE X.
           02  FILLER REDEFINES AVDATF.
             03 AVDATA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  AVDATI  PIC X(10).
           02  CUACTL    COMP  PIC  S9(4).
           02  CUACTF    PICTURE X.
           02  FILLER REDEFINES CUACTF.
             03 CUACTA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  CUACTI  PIC X(2).
           02  LAACTL    COMP  PIC  S9(4).
           02  LAACTF    PICTURE X.
           02  FILLER REDEFINES LAACTF.
             03 LAACTA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  LAACTI  PIC X(2).
           02  CACVVL    COMP  PIC  S9(4).
           02  CACVVF    PICTURE X.
           02  FILLER REDEFINES CACVVF.
             03 CACVVA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  CACVVI  PIC X(4).
           02  CACVV2L    COMP  PIC  S9(4).
           02  CACVV2F    PICTURE X.
           02  FILLER REDEFINES CACVV2F.
             03 CACVV2A    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  CACVV2I  PIC X(3).
           02  CUNAML    COMP  PIC  S9(4).
           02  CUNAMF    PICTURE X.
           02  FILLER REDEFINES CUNAMF.
             03 CUNAMA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  CUNAMI  PIC X(30).
           02  NAPASL    COMP  PIC  S9(4).
           02  NAPASF    PICTURE X.
           02  FILLER REDEFINES NAPASF.
             03 NAPASA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  NAPASI  PIC X(2).
           02  PWCOUL    COMP  PIC  S9(4).
           02  PWCOUF    PICTURE X.
           02  FILLER REDEFINES PWCOUF.
             03 PWCOUA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  PWCOUI  PIC X(2).
           02  PWDATL    COMP  PIC  S9(4).
           02  PWDATF    PICTURE X.
           02  FILLER REDEFINES PWDATF.
             03 PWDATA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  PWDATI  PIC X(10).
           02  PWTIML    COMP  PIC  S9(4).
           02  PWTIMF    PICTURE X.
           02  FILLER REDEFINES PWTIMF.
             03 PWTIMA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  PWTIMI  PIC X(5).
           02  PUDATL    COMP  PIC  S9(4).
           02  PUDATF    PICTURE X.
           02  FILLER REDEFINES PUDATF.
             03 PUDATA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  PUDATI  PIC X(10).
           02  MSGL    COMP  PIC  S9(4).
           02  MSGF    PICTURE X.
           02  FILLER REDEFINES MSGF.
             03 MSGA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  MSGI  PIC X(79).
           02  KEYL    COMP  PIC  S9(4).
           02  KEYF    PICTURE X.
           02  FILLER REDEFINES KEYF.
             03 KEYA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  KEYI  PIC X(79).
       01  CICP04O REDEFINES CICP04I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  SYSDC    PICTURE X.
           02  SYSDH    PICTURE X.
           02  SYSDO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  COMMUC    PICTURE X.
           02  COMMUH    PICTURE X.
           02  COMMUO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  SYSTC    PICTURE X.
           02  SYSTH    PICTURE X.
           02  SYSTO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  PTYPEC    PICTURE X.
           02  PTYPEH    PICTURE X.
           02  PTYPEO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CANUMC    PICTURE X.
           02  CANUMH    PICTURE X.
           02  CANUMO  PIC X(16).
           02  FILLER PICTURE X(3).
           02  CUNUMC    PICTURE X.
           02  CUNUMH    PICTURE X.
           02  CUNUMO  PIC X(18).
           02  FILLER PICTURE X(3).
           02  CASTAC    PICTURE X.
           02  CASTAH    PICTURE X.
           02  CASTAO  PIC X(3).
           02  FILLER PICTURE X(3).
           02  ACNUMC    PICTURE X.
           02  ACNUMH    PICTURE X.
           02  ACNUMO  PIC X(16).
           02  FILLER PICTURE X(3).
           02  LUDATC    PICTURE X.
           02  LUDATH    PICTURE X.
           02  LUDATO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  OPDATC    PICTURE X.
           02  OPDATH    PICTURE X.
           02  OPDATO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  DIINDC    PICTURE X.
           02  DIINDH    PICTURE X.
           02  DIINDO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  DISUBC    PICTURE X.
           02  DISUBH    PICTURE X.
           02  DISUBO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  DIDATC    PICTURE X.
           02  DIDATH    PICTURE X.
           02  DIDATO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  CATYPC    PICTURE X.
           02  CATYPH    PICTURE X.
           02  CATYPO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  PSINDC    PICTURE X.
           02  PSINDH    PICTURE X.
           02  PSINDO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  LOINDC    PICTURE X.
           02  LOINDH    PICTURE X.
           02  LOINDO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  LODATC    PICTURE X.
           02  LODATH    PICTURE X.
           02  LODATO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  EXDATC    PICTURE X.
           02  EXDATH    PICTURE X.
           02  EXDATO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  ACINDC    PICTURE X.
           02  ACINDH    PICTURE X.
           02  ACINDO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  AVDATC    PICTURE X.
           02  AVDATH    PICTURE X.
           02  AVDATO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  CUACTC    PICTURE X.
           02  CUACTH    PICTURE X.
           02  CUACTO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  LAACTC    PICTURE X.
           02  LAACTH    PICTURE X.
           02  LAACTO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  CACVVC    PICTURE X.
           02  CACVVH    PICTURE X.
           02  CACVVO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  CACVV2C    PICTURE X.
           02  CACVV2H    PICTURE X.
           02  CACVV2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  CUNAMC    PICTURE X.
           02  CUNAMH    PICTURE X.
           02  CUNAMO  PIC X(30).
           02  FILLER PICTURE X(3).
           02  NAPASC    PICTURE X.
           02  NAPASH    PICTURE X.
           02  NAPASO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  PWCOUC    PICTURE X.
           02  PWCOUH    PICTURE X.
           02  PWCOUO  PIC X(2).
           02  FILLER PICTURE X(3).
           02  PWDATC    PICTURE X.
           02  PWDATH    PICTURE X.
           02  PWDATO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  PWTIMC    PICTURE X.
           02  PWTIMH    PICTURE X.
           02  PWTIMO  PIC X(5).
           02  FILLER PICTURE X(3).
           02  PUDATC    PICTURE X.
           02  PUDATH    PICTURE X.
           02  PUDATO  PIC X(10).
           02  FILLER PICTURE X(3).
           02  MSGC    PICTURE X.
           02  MSGH    PICTURE X.
           02  MSGO  PIC X(79).
           02  FILLER PICTURE X(3).
           02  KEYC    PICTURE X.
           02  KEYH    PICTURE X.
           02  KEYO  PIC X(79).
