       01 CAWU01OT-REC.
          03 CAWU01OT-WORKLIST-ID           PIC 9(5).
          03 CAWU01OT-COLLESTOR             PIC 9(5).
          03 CAWU01OT-LOC-CODE              PIC 9(6).
          03 CAWU01OT-STATE                 PIC X(3).
          03 CAWU01OT-WORKLIST-STATUS       PIC 9(1).
