       01 CIC0016O-REC.
          05 CIC0016O-COUNT        PIC 9(3).
          05 CIC0016O-CARD.
             10 CIC0016O-CARD-NUMB   PIC 9(16) OCCURS 14 TIMES.
