       01 CIC0009I-REC.
          05 CIC0009I-OPTION               PIC 9(3).
          05 CIC0009I-APPL-ID              PIC 9(13).
          05 CIC0009I-DIRECTION            PIC X(2).
